loadtest/results/throughput.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/throughput.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m0s max duration (incl. graceful stop):
              * throughput: 200.00 iterations/s for 30s (maxVUs: 50-300, gracefulStop: 30s)


running (0m01.0s), 000/050 VUs, 198 complete and 0 interrupted iterations
throughput   [   3% ] 000/050 VUs  01.0s/30s  200.00 iters/s

running (0m02.0s), 000/050 VUs, 397 complete and 0 interrupted iterations
throughput   [   7% ] 000/050 VUs  02.0s/30s  200.00 iters/s

running (0m03.0s), 000/050 VUs, 597 complete and 0 interrupted iterations
throughput   [  10% ] 000/050 VUs  03.0s/30s  200.00 iters/s

running (0m04.0s), 000/050 VUs, 797 complete and 0 interrupted iterations
throughput   [  13% ] 000/050 VUs  04.0s/30s  200.00 iters/s

running (0m05.0s), 000/050 VUs, 997 complete and 0 interrupted iterations
throughput   [  17% ] 000/050 VUs  05.0s/30s  200.00 iters/s

running (0m06.0s), 000/050 VUs, 1197 complete and 0 interrupted iterations
throughput   [  20% ] 000/050 VUs  06.0s/30s  200.00 iters/s

running (0m07.0s), 000/050 VUs, 1397 complete and 0 interrupted iterations
throughput   [  23% ] 000/050 VUs  07.0s/30s  200.00 iters/s

running (0m08.0s), 000/050 VUs, 1597 complete and 0 interrupted iterations
throughput   [  27% ] 000/050 VUs  08.0s/30s  200.00 iters/s

running (0m09.0s), 000/050 VUs, 1797 complete and 0 interrupted iterations
throughput   [  30% ] 000/050 VUs  09.0s/30s  200.00 iters/s

running (0m10.0s), 000/050 VUs, 1997 complete and 0 interrupted iterations
throughput   [  33% ] 000/050 VUs  10.0s/30s  200.00 iters/s

running (0m11.0s), 001/050 VUs, 2197 complete and 0 interrupted iterations
throughput   [  37% ] 001/050 VUs  11.0s/30s  200.00 iters/s

running (0m12.0s), 000/050 VUs, 2397 complete and 0 interrupted iterations
throughput   [  40% ] 000/050 VUs  12.0s/30s  200.00 iters/s

running (0m13.0s), 000/050 VUs, 2597 complete and 0 interrupted iterations
throughput   [  43% ] 000/050 VUs  13.0s/30s  200.00 iters/s

running (0m14.0s), 000/050 VUs, 2797 complete and 0 interrupted iterations
throughput   [  47% ] 000/050 VUs  14.0s/30s  200.00 iters/s

running (0m15.0s), 000/050 VUs, 2997 complete and 0 interrupted iterations
throughput   [  50% ] 000/050 VUs  15.0s/30s  200.00 iters/s

running (0m16.0s), 000/050 VUs, 3197 complete and 0 interrupted iterations
throughput   [  53% ] 000/050 VUs  16.0s/30s  200.00 iters/s

running (0m17.0s), 000/050 VUs, 3397 complete and 0 interrupted iterations
throughput   [  57% ] 000/050 VUs  17.0s/30s  200.00 iters/s

running (0m18.0s), 000/050 VUs, 3597 complete and 0 interrupted iterations
throughput   [  60% ] 000/050 VUs  18.0s/30s  200.00 iters/s

running (0m19.0s), 000/050 VUs, 3797 complete and 0 interrupted iterations
throughput   [  63% ] 000/050 VUs  19.0s/30s  200.00 iters/s

running (0m20.0s), 000/050 VUs, 3997 complete and 0 interrupted iterations
throughput   [  67% ] 000/050 VUs  20.0s/30s  200.00 iters/s

running (0m21.0s), 000/050 VUs, 4197 complete and 0 interrupted iterations
throughput   [  70% ] 000/050 VUs  21.0s/30s  200.00 iters/s

running (0m22.0s), 000/050 VUs, 4397 complete and 0 interrupted iterations
throughput   [  73% ] 000/050 VUs  22.0s/30s  200.00 iters/s

running (0m23.0s), 000/050 VUs, 4597 complete and 0 interrupted iterations
throughput   [  77% ] 000/050 VUs  23.0s/30s  200.00 iters/s

running (0m24.0s), 000/050 VUs, 4797 complete and 0 interrupted iterations
throughput   [  80% ] 000/050 VUs  24.0s/30s  200.00 iters/s

running (0m25.0s), 000/050 VUs, 4997 complete and 0 interrupted iterations
throughput   [  83% ] 000/050 VUs  25.0s/30s  200.00 iters/s

running (0m26.0s), 000/050 VUs, 5197 complete and 0 interrupted iterations
throughput   [  87% ] 000/050 VUs  26.0s/30s  200.00 iters/s

running (0m27.0s), 000/050 VUs, 5397 complete and 0 interrupted iterations
throughput   [  90% ] 000/050 VUs  27.0s/30s  200.00 iters/s

running (0m28.0s), 000/050 VUs, 5597 complete and 0 interrupted iterations
throughput   [  93% ] 000/050 VUs  28.0s/30s  200.00 iters/s

running (0m29.0s), 000/050 VUs, 5797 complete and 0 interrupted iterations
throughput   [  97% ] 000/050 VUs  29.0s/30s  200.00 iters/s

running (0m30.0s), 000/050 VUs, 5997 complete and 0 interrupted iterations
throughput   [ 100% ] 000/050 VUs  30.0s/30s  200.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<100' p(95)=2.09ms
    ✓ 'p(99)<300' p(99)=4.08ms

    http_req_failed
    ✗ 'rate<0.01' rate=94.68%


  █ TOTAL RESULTS 

    checks_total.......: 6000   199.983681/s
    checks_succeeded...: 5.31%  319 out of 6000
    checks_failed......: 94.68% 5681 out of 6000

    ✗ status is 200
      ↳  5% — ✓ 319 / ✗ 5681

    HTTP
    http_req_duration..............: avg=823.75µs min=213µs    med=654µs    max=17.93ms p(90)=1.17ms p(95)=2.09ms
      { expected_response:true }...: avg=3.36ms   min=974µs    med=3.22ms   max=17.93ms p(90)=4.63ms p(95)=5.42ms
    http_req_failed................: 94.68% 5681 out of 6000
    http_reqs......................: 6000   199.983681/s

    EXECUTION
    iteration_duration.............: avg=919.94µs min=248.62µs med=741.25µs max=18.25ms p(90)=1.29ms p(95)=2.28ms
    iterations.....................: 6000   199.983681/s
    vus............................: 0      min=0            max=0 
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 13 MB  428 kB/s
    data_sent......................: 552 kB 18 kB/s



running (0m30.0s), 000/050 VUs, 6000 complete and 0 interrupted iterations
throughput ✓ [ 100% ] 000/050 VUs  30s  200.00 iters/s
time="2026-05-05T23:02:43+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"